;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! org-super-agenda)
(package! centered-cursor-mode)
(package! github-review)
(package! exec-path-from-shell)
(package! prettier-js)
(package! emmet-mode)
(package! vue-mode)
(package! pug-mode)
(package! flycheck-clj-kondo)
(package! exec-path-from-shell)
(package! haskell-mode)
(package! lsp-haskell)
(package! ormolu)
(package! repl-toggle)
(package! undo-tree)
(package! with-editor)
(package! ocamlformat)
(package! yaml-mode)
(package! pdf-tools)
(package! rescript-mode)
(package! lsp-rescript)
(package! lsp-ui)
(package! restclient)
(package! terraform-mode)
(package! ob-elm)
(package! org-jira)
(package! org-roam-ui)
(package! just-mode)
(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
(package! elm-mode)
(package! origami)
(package! outline-indent)
