;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! org-super-agenda)
(package! centered-cursor-mode)
(package! github-review)
(package! exec-path-from-shell)
(package! prettier-js)
(package! emmet-mode)
(package! vue-mode)
(package! pug-mode)
